# coding: utf-8

from django.http import HttpResponse, Http404
from django.template.loader import get_template
from django.template import RequestContext
from django.shortcuts import render

def latest(request):
    posts = [{'title': 'Hello World',
              'created': '2014-02-21 11:00:00',
              'text': '<p>This is text of post</p><p>This is another line of text of post. This is another sentence of another line of text of post.</p>'},
             {'title': 'Hello World 2',
              'created': '2014-02-21 10:00:00',
              'text': '<p>This is text of post</p><p>This is another line of text of post. This is another sentence of another line of text of post.</p>'}]
    context = {'posts': posts, 'title': 'Latest posts', 'base_tpl': 'blog/base/full.html'}
    return HttpResponse(render(request, 'blog/pages/posts.html', RequestContext(request, context)))

def post(request, post_id):
    if post_id == '234':
        comments = [{'author': 'Author Name',
                     'created': '2014-02-21 11:05:00',
                     'text': 'Veri sank u )))'},
                    {'author': 'Author Name',
                     'created': '2014-02-21 11:06:01',
                     'text': 'Sori fo mai inglish ahahah )))'}
                   ]
        context = {'post': {'title': 'Hello World. Проверка кириллицы.',
                            'created': '2014-02-21 11:00:00',
                            'text': """
                                <p>Повседневная практика показывает, что сложившаяся структура организации представляет собой интересный эксперимент проверки новых предложений. Товарищи! укрепление и развитие структуры позволяет выполнять важные задания по разработке новых предложений. С другой стороны постоянный количественный рост и сфера нашей активности позволяет оценить значение соответствующий условий активизации. Товарищи! постоянное информационно-пропагандистское обеспечение нашей деятельности требуют определения и уточнения системы обучения кадров, соответствует насущным потребностям.</p>
                                <p>Задача организации, в особенности же консультация с широким активом представляет собой интересный эксперимент проверки системы обучения кадров, соответствует насущным потребностям. С другой стороны укрепление и развитие структуры требуют определения и уточнения форм развития. Значимость этих проблем настолько очевидна, что постоянный количественный рост и сфера нашей активности требуют определения и уточнения позиций, занимаемых участниками в отношении поставленных задач. Товарищи! реализация намеченных плановых заданий позволяет оценить значение дальнейших направлений развития. Задача организации, в особенности же начало повседневной работы по формированию позиции требуют от нас анализа форм развития. Равным образом консультация с широким активом обеспечивает широкому кругу (специалистов) участие в формировании соответствующий условий активизации.</p>
                                <p>С другой стороны консультация с широким активом в значительной степени обуславливает создание системы обучения кадров, соответствует насущным потребностям. Идейные соображения высшего порядка, а также реализация намеченных плановых заданий позволяет выполнять важные задания по разработке дальнейших направлений развития. Значимость этих проблем настолько очевидна, что дальнейшее развитие различных форм деятельности представляет собой интересный эксперимент проверки системы обучения кадров, соответствует насущным потребностям. Задача организации, в особенности же постоянный количественный рост и сфера нашей активности обеспечивает широкому кругу (специалистов) участие в формировании модели развития. Равным образом сложившаяся структура организации способствует подготовки и реализации позиций, занимаемых участниками в отношении поставленных задач. Задача организации, в особенности же сложившаяся структура организации играет важную роль в формировании существенных финансовых и административных условий.</p>
                            """},
                   'comments': comments,
                   'title': 'Hello World. Проверка кириллицы.',
                   'base_tpl': 'blog/base/full.html',
                  }
        return HttpResponse(render(request, 'blog/pages/post.html', RequestContext(request, context)))
    else:
        raise Http404
